# Nurbs Surface Data Get Knot U Method

Source: https://www.revitapidocs.com/2026/dd725f1c-b40d-8070-d09a-563565c09572.htm

---

| Nurbs Surface Data Get Knot U Method |
| --- |

Get the knot in the u\-direction.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double GetKnotU(
	int idx
)
```

```
Public Function GetKnotU (
	idx As Integer
) As Double
```

```
public:
double GetKnotU(
	int idx
)
```

```
member GetKnotU :
        idx : int -> float
```

#### Parameters

idx Int32
:   The index of the knot.

#### Return Value

Double Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | Out\-of\-range access. |

See Also

#### Reference

NurbsSurfaceData Class Autodesk.Revit.DB Namespace